Revit 2024 API
HVACLoadBuildingType.Create Method
 Creates a building type element.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public static HVACLoadBuildingType Create(
	Document document,
	string name
)
Visual Basic
Public Shared Function Create ( _
	document As Document, _
	name As String _
) As HVACLoadBuildingType
Visual C++
public:
static HVACLoadBuildingType^ Create(
	Document^ document,
	String^ name
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The document.
name
Type: System.String
 The building type name.
Return Value
 The new building type.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  name is an empty string or contains only whitespace. -or- name cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~". -or- The given value for name is already in use as a building type name.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
HVACLoadBuildingType Class
Autodesk.Revit.DB.Analysis Namespace